questions = [

    {
        'question': 'Как Вы любите отдыхать?',
        'options': ['В одиночестве', 'В кругу друзей'],
        'animal_mapping': {
            'В одиночестве': ['Малайский медведь', 'Кинкажу', 'Андский кондор', 'Амурский лесной кот'],
            'В кругу друзей': ['Лахтак', 'Сенегальский галаго', 'Ирбис']
        }
    },
    {
        'question': 'Что бы Вы предпочли?',
        'options': ['Морской круиз', 'Прогулка по лесу', 'Поход в горы', 'Полет на дельтпалане'],
        'animal_mapping': {
            'Морской круиз': ['Лахтак'],
            'Прогулка по лесу': ['Амурский лесной кот', 'Малайский медведь', 'Кинкажу' 'Сенегальский галаго'],
            'Поход в горны': ['Ирбис', 'Андский кондор'],
            'Полет на дельтаплане': ['Андский кондор']
        }
    },
    {
        'question': 'Когда вы наиболее активны?',
        'options': ['Утром', 'Днем', 'Вечером', 'Ночью'],
        'animal_mapping': {
            'Утром': ['Амурский лесной кот', 'Ирбис'],
            'Днем': ['Амурский лесной кот', 'Малайский медведь', 'Лахтак', 'Ирбис', 'Андский кондор'],
            'Вечером': ['Лахтак', 'Кинкажу'],
            'Ночью': ['Кинкажу', 'Сенегальский галаго']
        }
    },
    {
        'question': 'Как бы вы предпочли спорт?',
        'options': ['Бег', 'Плавание', 'Акробатика', 'Парашютизм', 'Спортивная ходьба'],
        'animal_mapping': {
            'Бег': ['Ирбис', 'Амурский лесной кот'],
            'Плавание': ['Лахтак'],
            'Акробатика': ['Кинкажу', 'Сенегальский галаго'],
            'Парашютизм': ['Андский кондор'],
            'Спортивная ходьба': ['Андский кондор']
        }
    },
    {
        'question': 'Какой климат вам подходит больше?',
        'options': ['Жаркий', 'Теплый', 'Прохладный'],
        'animal_mapping': {
            'Жаркий': ['Сенегальский галаго', 'Малайский медведь'],
            'Теплый': ['Кинкажу', 'Малайский медведь'],
            'Прохладный': ['Амурский лесной кот', 'Лахтак', 'Андский кондор', 'Ирбис']
        }
    },
    {
        'question': 'Что вы бы предпочли съесть?',
        'options': ['Фрукты', 'Мясо', 'Рыбу', 'Насекомых'],
        'animal_mapping': {
            'Фрукты': ['Кинкажу', 'Малайский медведь'],
            'Мясо': ['Сенегальский галаго', 'Амурский лесной кот', 'Ирбис', 'Андский кондор'],
            'Рыбу': ['Лахтак', 'Андский кондор'],
            'Насекомых': ['Малайский медведь']
        }
    },
    ]